# Intro a Pandas

Pandas es una librer√≠a de Python que nos permite trabajar con datos tabulares de manera muy eficiente. 

En el mundo del an√°lisis de datos, Pandas se ha convertido en una herramienta fundamental para cient√≠ficos de datos, analistas y cualquier persona que trabaje con datos en Python. Con Pandas, puedes realizar operaciones como limpieza, manipulaci√≥n, visualizaci√≥n y an√°lisis de datos de manera eficiente.

![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1920px-Pandas_logo.svg.png)

## 1. Instalar Pandas

Para instalar Pandas, ejecuta el siguiente comando en tu terminal:

```bash
pip install pandas==<version>
```

In [3]:
import pandas as pd

## 2. Series y Dataframes

Pandas tiene dos estructuras de datos principales: Series y DataFrames.

- **Series**: es un array unidimensional. Es similar a una columna en una tabla de Excel.
- **DataFrame**: es una estructura de datos bidimensional con filas y columnas con etiquetas. Es similar a una tabla de Excel.

### 2.1 Series

Para crear una Serie, puedes pasar una lista de elementos y Pandas crear√° una Serie con √≠ndices num√©ricos.

In [4]:
serie = pd.Series([1, 2, 3, 4, 5])
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

### 2.2 DataFrames

Para crear un DataFrame, puedes pasar un diccionario de listas, donde cada clave es el nombre de la columna y cada valor es una lista de elementos.

In [5]:
data = {
    'name': ['Mar√≠a', 'Daniel', 'Marisa', 'David', 'Sabrina'],
    'age': [16, 7, 29, None, 33], 
    'city': ['Madrid', 'Madrid', 'M√°laga', 'M√°laga', 'Valladolid'],
    'height': [None, 1.20, 1.60, 2.01, 1.83]
}

df = pd.DataFrame(data)
df

      name   age        city  height
0    Mar√≠a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
3    David   NaN      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Aunque lo m√°s normal es crear DataFrames a partir de archivos CSV, Excel, bases de datos, etc. En este caso, vamos a guardar el DataFrame en un archivo CSV y posteriormente lo leeremos.

In [6]:
CSV_PATH = 'data.csv'

df.to_csv(CSV_PATH, index=False)
df = pd.read_csv(CSV_PATH)
df

      name   age        city  height
0    Mar√≠a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
3    David   NaN      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83

## 3. Basics de un Dataframe

Podemos visualizar los primeros/√∫ltimos registros de un DataFrame con los m√©todos `head()` y `tail()`, respectivamente.

In [10]:
df.head(3)

     name   age    city  height
0   Mar√≠a  16.0  Madrid     NaN
1  Daniel   7.0  Madrid     1.2
2  Marisa  29.0  M√°laga     1.6

In [11]:
df.tail(2)

      name   age        city  height
3    David   NaN      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Los dataframes tienen una serie de atributos b√°sicos: `.columns`, `.values`, `.shape`, `.dtypes`, etc. Algunos de ellos te recordar√°n a los atributos de un array de NumPy.

In [12]:
df.columns

Index(['name', 'age', 'city', 'height'], dtype='object')

In [13]:
df.values

array([['Mar√≠a', 16.0, 'Madrid', nan],
       ['Daniel', 7.0, 'Madrid', 1.2],
       ['Marisa', 29.0, 'M√°laga', 1.6],
       ['David', nan, 'M√°laga', 2.01],
       ['Sabrina', 33.0, 'Valladolid', 1.83]], dtype=object)

In [14]:
df.shape

(5, 4)

In [10]:
df.dtypes

name       object
age       float64
city       object
height    float64
dtype: object

## 4. Estad√≠sticas b√°sicas

Pandas nos permite obtener la informaci√≥n general de un Dataframe con el m√©todo `info()`.

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    5 non-null      object
 3   height  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes



Pandas nos permite obtener estad√≠sticas b√°sicas de un DataFrame con el m√©todo `describe()`. Este m√©todo nos devuelve un resumen de las estad√≠sticas descriptivas de las **columnas num√©ricas**.

In [16]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.250000  1.660000
std    11.954776  0.349571
min     7.000000  1.200000
25%    13.750000  1.500000
50%    22.500000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

## 5. Indexaci√≥n

Recordemos que el indexing consiste en seleccionar un subconjunto de datos de un DataFrame. Recordemos antes c√≥mo era el dataframe original y veamos que Pandas nos permite indexar un DataFrame de diferentes maneras.

In [17]:
df

      name   age        city  height
0    Mar√≠a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
3    David   NaN      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83


**Por nombre de columna**: `df['column_name']`

In [18]:
df['name']

0      Mar√≠a
1     Daniel
2     Marisa
3      David
4    Sabrina
Name: name, dtype: object

**Por posici√≥n (√≠ndice) de la fila**: `df.iloc[0]`

In [19]:
df.iloc[0]

name       Mar√≠a
age         16.0
city      Madrid
height       NaN
Name: 0, dtype: object

**Por etiqueta de la fila**: `df.loc['row_label']`

In [20]:
df.loc[0]  # en este caso, como los indices son los mismos que las posiciones, `loc` es lo mismo que `iloc`

name       Mar√≠a
age         16.0
city      Madrid
height       NaN
Name: 0, dtype: object

**Por etiqueta de fila y columna**: `df.loc['row_label', 'column_name']`

In [22]:
df.loc[0, 'name']

'Mar√≠a'

**Por condici√≥n**: `df[df['column_name'] > 0]`

In [24]:
condition = df['age'] > 18
df[condition]  # as√≠ se filtran los datos

      name   age        city  height
2   Marisa  29.0      M√°laga    1.60
4  Sabrina  33.0  Valladolid    1.83

**Por valores m√≠nimos y m√°ximos**: `df['column_name'].idxmin()` y `df['column_name'].idxmax()`

In [26]:
max_age_row_idx = df["age"].idxmax()
max_age_row = df.loc[max_age_row_idx]
max_age_row

name         Sabrina
age             33.0
city      Valladolid
height          1.83
Name: 4, dtype: object

## 6. Data Cleaning

El data cleaning es un paso fundamental en cualquier an√°lisis de datos. Pandas nos permite realizar operaciones de limpieza de datos de manera muy eficiente. **Es muy com√∫n encontrarnos con valores nulos** en nuestros datasets. Pandas nos ofrece m√©todos para tratar estos valores nulos, como `dropna()`, `fillna()` y `isnull()`. Recordemos primero, el dataset original.

In [20]:
df

      name   age        city  height
0    Mar√≠a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
3    David   NaN      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Por ejemplo, para ver si hay valores nulos en un DataFrame, podemos usar los metodos `isnull()` √≥ `isna()`.

In [27]:
df.isnull()

    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Para **eliminar** las filas con valores nulos, podemos usar el m√©todo `dropna()`.

In [22]:
df.dropna()

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
4  Sabrina  33.0  Valladolid    1.83

Para **rellenar** los valores nulos con un valor espec√≠fico, podemos usar el m√©todo `fillna()`.

In [23]:
df.fillna(0)  # rellena los valores nulos con 0

      name   age        city  height
0    Mar√≠a  16.0      Madrid    0.00
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
3    David   0.0      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Estos m√©todos son aplicables tambi√©n a las Series (columnas de un DataFrame).

In [28]:
df['age'].fillna(10)

0    16.0
1     7.0
2    29.0
3    10.0
4    33.0
Name: age, dtype: float64

# Ejercicios

Toma el dataframe original y gu√°rdalo como un CSV

In [29]:
df.to_csv

<bound method NDFrame.to_csv of       name   age        city  height
0    Mar√≠a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M√°laga    1.60
3    David   NaN      M√°laga    2.01
4  Sabrina  33.0  Valladolid    1.83>

Ahora lee el archivo CSV

In [30]:
pd.read_csv

<function pandas.io.parsers.readers.read_csv(filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]', *, sep: 'str | None | lib.NoDefault' = <no_default>, delimiter: 'str | None | lib.NoDefault' = None, header: "int | Sequence[int] | None | Literal['infer']" = 'infer', names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>, index_col: 'IndexLabel | Literal[False] | None' = None, usecols: 'UsecolsArgType' = None, dtype: 'DtypeArg | None' = None, engine: 'CSVEngine | None' = None, converters: 'Mapping[Hashable, Callable] | None' = None, true_values: 'list | None' = None, false_values: 'list | None' = None, skipinitialspace: 'bool' = False, skiprows: 'list[int] | int | Callable[[Hashable], bool] | None' = None, skipfooter: 'int' = 0, nrows: 'int | None' = None, na_values: 'Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None' = None, keep_default_na: 'bool' = True, na_filter: 'bool' = True, verbose: 'bool | lib.NoDefault' = <no_default>, skip_blank_lines: 'bool' = True, parse_dates: 'bool | Sequence[Hashable] | None' = None, infer_datetime_format: 'bool | lib.NoDefault' = <no_default>, keep_date_col: 'bool | lib.NoDefault' = <no_default>, date_parser: 'Callable | lib.NoDefault' = <no_default>, date_format: 'str | dict[Hashable, str] | None' = None, dayfirst: 'bool' = False, cache_dates: 'bool' = True, iterator: 'bool' = False, chunksize: 'int | None' = None, compression: 'CompressionOptions' = 'infer', thousands: 'str | None' = None, decimal: 'str' = '.', lineterminator: 'str | None' = None, quotechar: 'str' = '"', quoting: 'int' = 0, doublequote: 'bool' = True, escapechar: 'str | None' = None, comment: 'str | None' = None, encoding: 'str | None' = None, encoding_errors: 'str | None' = 'strict', dialect: 'str | csv.Dialect | None' = None, on_bad_lines: 'str' = 'error', delim_whitespace: 'bool | lib.NoDefault' = <no_default>, low_memory: 'bool' = True, memory_map: 'bool' = False, float_precision: "Literal['high', 'legacy'] | None" = None, storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>) -> 'DataFrame | TextFileReader'>

Muestra los 3 primeros registros del DataFrame.

Muestra los 4 √∫ltimos registros del DataFrame.

Dime cuantos datos tiene el DataFrame (üí° es lo mismo que calcular el n√∫mero de filas). ¬øen `numpy` vimos 2 formas de calcular este dato, recuerdas?

Mu√©strame las estad√≠sticas b√°sicas del DataFrame.

Obt√©n los datos de la columna 'name' ¬øCual es el tipo de dato de esta columna?

üå∂Ô∏è Recuera que una Serie se puede tratar como un array de numpy, por tanto, obt√©n los datos de la columna "age" y calcula la media. ¬øCoincide con el resultado que arroja pandas en la celda superior? (üí° en `numpy` la media se calcula usando `np.mean`)

Ahora calcula la edad m√°xima y m√≠nima de la columna "age".

üå∂Ô∏è Una vez obtenida la edad m√≠nima, ¬øCual es el nombre de dicha persona?

Filtra el DataFrame: muestra las filas donde la edad sea mayor a 25.

Filtra el DataFrame: muestra las filas donde la gente sea de 'M√°laga'. (üí° utiliza el operador `==`)

üå∂Ô∏è Filtra el Dataframe: filas donde la gente sea de 'M√°laga' y mayor de 25. (üí° para sumar dos condiciones se utiliza el operador `and` que se representa en python con `&`, i.e.: 

```python
compose_condition = condition1 & condition2
```

Obt√©n la m√°scara de los valores que son nulos en el DataFrame.

Ahora obt√©n la m√°scara de los valores que NO son nulos en el DataFrame. (üí° busca en la documentaci√≥n de pandas, o en google, c√≥mo hacerlo)

Elimina los valores nulos del DataFrame.

Rellena todos los valores nulos con 1.

Ahora rellena s√≥lo los valores nulos de la columna 'age' con 10.

üå∂Ô∏è Ahora rellena los valores nulos de la columna 'height' con la media de dicha columna

## BONUS: Explora los datos del dataset de Titanic

El dataset de Titanic es un dataset muy famoso en el mundo del an√°lisis de datos. Contiene informaci√≥n sobre los pasajeros del Titanic, incluyendo si sobrevivieron o no, su edad, sexo, clase, etc.

In [25]:
CSV_PATH = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

df = pd.read_csv(CSV_PATH)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Hazte preguntas como, ¬øQu√© porcentaje de pasajeros sobrevivi√≥? ¬øCu√°l es la edad media de los pasajeros? ¬øCu√°ntos pasajeros hab√≠a en cada clase? ¬øCu√°l es la edad media de los pasajeros que sobrevivieron y de los que no? ¬øCu√°l es la edad m√°xima de los pasajeros que sobrevivieron y de los que no?